hull/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-07;
        relTol          0.05;
    }

    pFinal
    {
	$p;
	tolerance       1e-8;
	relTol	        0;
    }

    U
    {
        solver		PBiCGStab;
	preconditioner	DILU;
	tolerance	1e-7;
	relTol		0.05;
    }

    UFinal
    {
	$U;
	tolerance	1e-8;
	relTol		0;
    }

    "(k|omega|nut)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
	tolerance       1e-7;
	relTol          0.05;
    }

    "(kFinal|omegaFinal)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
	tolerance       1e-8;
        relTol          0;
    }
}

PIMPLE
{
     nOuterCorrectors            4;
     nCorrectors                 3;
     nNonOrthogonalCorrectors    1;
     momentumPredictor           yes;

     residualControl
     {
         p                       1e-4;
	 U                       1e-5;
	 "(k|omega)"             1e-5;
     }
}

relaxationFactors
{
    fields
    {
        p               0.3;  // Relajación fuerte = estabilidad
    }
    equations
    {
        U               0.5;  // Relajación moderada
        "(k|omega)"     0.5;
    }
}


// ************************************************************************* //
